In [2]:
import pandas as pd
import sqlite3

In [3]:
con = sqlite3.connect("../../privileged_data/money.sqlite")

In [9]:
account_df = pd.read_sql_query("SELECT Z_PK account_id, ZUID uuid, ZGROUPUID account_type_id, ZNICNAME account_name  FROM ZASSET", con)
account_df.info()
account_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   account_id       26 non-null     int64
 1   uuid             26 non-null     object
 2   account_type_id  26 non-null     object
 3   account_name     26 non-null     object
dtypes: int64(1), object(3)
memory usage: 960.0+ bytes

,account_id,uuid,account_type_id,account_name
0,1,2,1,Bank Accounts
1,2,1,11,Cash
2,3,3,2,Card
3,4,EA8BACDD-74C6-4DD7-A3EF-81E27C78B6B8,1,Libreton BBVA
4,5,BDEA0420-DA3C-4285-B9A9-435AFC95BDC1,8,GBM - Acciones

In [5]:
account_type_df = pd.read_sql_query("SELECT Z_PK account_type_id, ZASSETGROUPNAME account_type_name FROM ZASSETGROUP", con)
account_type_df.info()
account_type_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   account_type_id    11 non-null     int64
 1   account_type_name  11 non-null     object
dtypes: int64(1), object(1)
memory usage: 304.0+ bytes

   account_type_id account_type_name
0                1            Others
1                2        Overdrafts
2                3       Investments
3                4        Debit Card
4                5              Cash

In [6]:
category_df = pd.read_sql_query("SELECT Z_PK category_id, ZDOTYPE category_type, ZNAME category_name FROM ZCATEGORY", con)
category_df.info()
category_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   category_id    78 non-null     int64
 1   category_type  78 non-null     int64
 2   category_name  78 non-null     object
dtypes: int64(2), object(1)
memory usage: 2.0+ KB

   category_id  category_type category_name
0            1              1      ðŸ’„ Beauty
1            2              1          Apps
2            3              1     Textbooks
3            4              0   ðŸ¤‘ Allowance
4            5              1        Makeup

In [18]:
movements_df = pd.read_sql_query("SELECT Z_PK movement_id, ZASSETUID account_uuid, ZAMOUNT amount, ZUTIME timestamp, ZCONTENT concept FROM ZINOUTCOME", con)
movements_df.tail()

,movement_id,account_uuid,amount,timestamp,concept
1001,1002,DFC43C38-ACA2-4D09-9942-3E1E0B21A5E4,611.0,1691981734998,Liverpool restaurante
1002,1003,1,50.0,1691981770991,Estacionamiento
1003,1004,1,20.0,1691981783759,Estacionamiento
1004,1005,1,65.0,1691981801162,Pan esperanza
1005,1006,1,23.0,1691981827236,Lechita

In [23]:
movements_df.groupby('concept')
['amount'].sum()

concept
                        658352.81
+ Prima vacacional       59182.10
1Password Anuality         604.70
20Lts                      450.00
33.131                     808.07
                          ...
Yerbabuena del sisal       500.00
YouTube premium            717.00
Zafiro alimento            197.00
Zapatos arreglo            200.00
Ãštiles Jamin               100.00
Name: amount, Length: 392, dtype: float64